// Задача 1: Написать программу, которая считывает через prompt число и выводит в консоль ее квадрат.

// let number = prompt("add a number:");
//         console.log(number**2);


//  Задача 2: Написать программу, которая получает через prompt одно число и выводит одну из строк “число чётнoe”, “число нечётнoe”, “число равно нулю”.

// let number = prompt("add a number:");
// if(+number === 0)
//   {console.log("равно нулю");
// }else if (+number % 2 ===0) 
//   {console.log("число чётнoe");
// }else if(+number % 2 !=0) 
//   {console.log("число нечётнoe");
// }


// Задача 3:Написать программу, которая получает значение из prompt и выводит фразу “Это значение можно преобразовать в число” или “Это значение преобразовать в число не получится. Получится NaN”.

// let number = prompt("add a number:");
// if(+number){
//     console.log("Это значение можно преобразовать в число");
// }else{console.log("Это значение преобразовать в число не получится. Получится NaN");}